golang-escape-analysis.org.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-14 二 19:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Golang escape analysis</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="rcmerci" />
<meta name="keywords" content="golang" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="preamble" class="status">
<p class="author">Author: rcmerci</p>
<p class="date">Updated: 2019-05-14 二 19:44</p>
</div>
<div id="content">
<h1 class="title">Golang escape analysis</h1>
<div class="abstract">
<p>
This article introduces the principle and general implementation of
golang's escape analysis.
</p>

</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org26010b0">1. <span class="todo TODO">TODO</span> Some examples</a>
<ul>
<li><a href="#org4a7cffc">1.1. example 1</a></li>
<li><a href="#org406c998">1.2. <span class="todo TODO">TODO</span> example 2</a></li>
<li><a href="#org85c96d3">1.3. example 3</a></li>
</ul>
</li>
<li><a href="#orga07922c">2. high level steps of escape analysis</a></li>
<li><a href="#org36647e2">3. visitBottomUp</a></li>
<li><a href="#org39f905a">4. draft notes</a></li>
<li><a href="#orgf2766fc">5. references</a></li>
</ul>
</div>
</div>




<div id="outline-container-org26010b0" class="outline-2">
<h2 id="org26010b0"><span class="section-number-2">1</span> <span class="todo TODO">TODO</span> Some examples</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org4a7cffc" class="outline-3">
<h3 id="org4a7cffc"><span class="section-number-3">1.1</span> example 1</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #40883f;">// </span><span style="color: #40883f;">go tool compile -m -m -m -m -l main.go</span>
<span style="color: #989848;">package</span> main

<span style="color: #989848;">func</span> <span style="color: #424242; font-weight: bold;">f1</span>(a <span style="color: #0287c8; font-weight: bold;">int</span>) (b *<span style="color: #0287c8; font-weight: bold;">int</span>) {
        b = &amp;a
        <span style="color: #989848;">return</span>
}
</pre>
</div>
<p>
compiler output:
</p>
<pre class="example">
escAnalyze [0xc000384000]
.   DCLFUNC l(3) esc(no) tc(1) FUNC-func(int) *int
.   DCLFUNC-body
.   .   AS l(4) tc(1)
.   .   .   NAME-main.b a(true) g(1) l(3) x(0) class(PPARAMOUT) tc(1) assigned PTR-*int
.   .   .   ADDR l(4) tc(1) PTR-*int
.   .   .   .   NAME-main.a a(true) g(2) l(3) x(0) class(PPARAM) tc(1) addrtaken used int

.   .   RETURN l(5) tc(1)
main.go:4:4:[1] f1 esc: b
main.go:4:6:[1] f1 esc: a
main.go:4:6:[1] f1 esc: &amp;a
main.go:4:4:[1] f1 esc: b = &amp;a
main.go:4:4:[1] f1 escassign: b( a(true) g(1) l(3) x(0) class(PPARAMOUT) tc(1) assigned)[NAME] = &amp;a( l(4) esc(no) ld(1) tc(1))[&amp;]
main.go:4:6::flows:: b &lt;- &amp;a
main.go:5:2:[1] f1 esc: return

escflood:0: dst b scope:f1[0]
escwalk: level:{0 0} depth:0  op=&amp; &amp;a( l(4) esc(no) ld(1) tc(1)) scope:f1[1] extraloopdepth=-1
main.go:4:6: &amp;a escapes to heap, level={0 0}, dst=b dst.eld=0, src.eld=1
main.go:3:9: moved to heap: a
escwalk: level:{-1 -1} depth:1 	 op=NAME a( a(true) g(2) l(3) x(0) class(PAUTOHEAP) esc(h) ld(1) tc(1) addrtaken used) scope:f1[1] extraloopdepth=1
</pre>
<ul class="org-ul">
<li>'&amp;a' escapes to heap</li>
<li>'a' moved to heap</li>
</ul>
</div>
</div>
<div id="outline-container-org406c998" class="outline-3">
<h3 id="org406c998"><span class="section-number-3">1.2</span> <span class="todo TODO">TODO</span> example 2</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #40883f;">// </span><span style="color: #40883f;">go tool compile -m -m -m -m -l main.go</span>
<span style="color: #989848;">package</span> main

<span style="color: #989848;">func</span> <span style="color: #424242; font-weight: bold;">f2</span>(a *<span style="color: #0287c8; font-weight: bold;">int</span>) *<span style="color: #0287c8; font-weight: bold;">int</span> {
        <span style="color: #989848;">return</span> a
}
</pre>
</div>
<pre class="example">
escAnalyze [0xc0000d82c0]
.   DCLFUNC l(19) esc(no) tc(1) FUNC-func(*int) *int
.   DCLFUNC-body
.   .   RETURN l(20) tc(1)
.   .   RETURN-list
.   .   .   NAME-main.a a(true) g(2) l(19) x(0) class(PPARAM) tc(1) used PTR-*int
main.go:20:2:[1] f2 esc: a
main.go:20:2:[1] f2 esc: return a
main.go:20:2:[1] f2 escassign: ~r1( a(true) g(1) l(19) x(0) class(PPARAMOUT))[NAME] = a( a(true) g(2) l(19) x(0) class(PPARAM) esc(no) ld(1) tc(1) used)[NAME]
main.go:20:2::flows:: ~r1 &lt;- a

escflood:0: dst ~r1 scope:f2[0]
escwalk: level:{0 0} depth:0  op=NAME a( a(true) g(2) l(19) x(0) class(PPARAM) esc(no) ld(1) tc(1) used) scope:f2[1] extraloopdepth=-1
main.go:19:9: leaking param: a to result ~r1 level={0 0}
</pre>
</div>
</div>


<div id="outline-container-org85c96d3" class="outline-3">
<h3 id="org85c96d3"><span class="section-number-3">1.3</span> example 3</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #40883f;">// </span><span style="color: #40883f;">go tool compile -m -m -m -l main.go</span>
<span style="color: #989848;">package</span> main
<span style="color: #989848;">type</span> <span style="color: #0287c8; font-weight: bold;">A</span> <span style="color: #989848;">interface</span> {
        <span style="color: #424242; font-weight: bold;">AA</span>(a int)
}

<span style="color: #989848;">func</span> <span style="color: #424242; font-weight: bold;">f2</span>(a <span style="color: #0287c8; font-weight: bold;">A</span>) {
        b := 1
        a.<span style="color: #424242; font-weight: bold;">AA</span>(b)
}
</pre>
</div>
<pre class="example">
main.go:8:2:[1] f2 esc: b
main.go:8:2:[1] f2 esc: var b int
main.go:8:4:[1] f2 esc: b
main.go:8:7:[1] f2 esc: 1
main.go:8:4:[1] f2 esc: b := 1
main.go:8:4:[1] f2 escassign: b( a(true) g(2) l(8) x(0) class(PAUTO) ld(1) tc(1) used)[NAME] = 1( l(8) tc(1))[LITERAL]
main.go:9:3:[1] f2 esc: a
main.go:9:3:[1] f2 esc: a.AA
main.go:9:6:[1] f2 esc: b
main.go:9:6:[1] f2 esc: a.AA(b)
main.go:9:6:[1] f2 escassign: .sink( x(0) class(PEXTERN) ld(-1))[NAME] = b( a(true) g(2) l(8) x(0) class(PAUTO) ld(1) tc(1) used)[NAME]
main.go:9:6:[1] f2 escassign: .sink( x(0) class(PEXTERN) ld(-1))[NAME] = a( a(true) g(1) l(7) x(0) class(PPARAM) esc(no) ld(1) tc(1) used)[NAME]

escflood:0: dst .sink scope:&lt;S&gt;[-1]
escwalk: level:{0 0} depth:0  op=NAME a( a(true) g(1) l(7) x(0) class(PPARAM) esc(no) ld(1) tc(1) used) scope:f2[1] extraloopdepth=-1
main.go:7:9: leaking param: a level={0 0} dst.eld=-1 src.eld=1 dst=.sink
&lt;autogenerated&gt;:1:[1] A.AA esc: .this
&lt;autogenerated&gt;:1:[1] A.AA esc: .this.AA
&lt;autogenerated&gt;:1:[1] A.AA esc: a
&lt;autogenerated&gt;:1:[1] A.AA esc: .this.AA(a)
&lt;autogenerated&gt;:1:[1] A.AA escassign: .sink( x(0) class(PEXTERN) ld(-1))[NAME] = a( a(true) g(2) l(4) x(0) class(PPARAM) ld(1) tc(1) used)[NAME]
&lt;autogenerated&gt;:1:[1] A.AA escassign: .sink( x(0) class(PEXTERN) ld(-1))[NAME] = .this( a(true) g(1) l(1) x(0) class(PPARAM) esc(no) ld(1) tc(1) used)[NAME]

escflood:0: dst .sink scope:A.AA[-1]
escwalk: level:{0 0} depth:0  op=NAME .this( a(true) g(1) l(1) x(0) class(PPARAM) esc(no) ld(1) tc(1) used) scope:A.AA[1] extraloopdepth=-1
&lt;autogenerated&gt;:1: leaking param: .this level={0 0} dst.eld=-1 src.eld=1 dst=.sink
</pre>
</div>
</div>
</div>
<div id="outline-container-orga07922c" class="outline-2">
<h2 id="orga07922c"><span class="section-number-2">2</span> high level steps of escape analysis</h2>
<div class="outline-text-2" id="text-2">
<p>
Analyze all defined functions from the bottom up(<code>visitBottomUp</code>),
analyze a set of functions (recursively with each other) or a
function each time using <code>escAnalyze</code>.
</p>

<p>
The general flow of <code>escAnalyze</code>:
</p>
<ul class="org-ul">
<li>Construct all flows of src -&gt; dst (<code>escfunc</code>)</li>
<li>Traverse all dsts, mark on <code>Node</code> that meets the escape condition (<code>escflood</code>)</li>
</ul>
</div>
</div>

<div id="outline-container-org36647e2" class="outline-2">
<h2 id="org36647e2"><span class="section-number-2">3</span> visitBottomUp</h2>
<div class="outline-text-2" id="text-3">
<p>
The entry in <code>escape analysis</code> is the <code>escapes</code> function.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #989848;">func</span> <span style="color: #424242; font-weight: bold;">escapes</span>(all []*<span style="color: #0287c8; font-weight: bold;">Node</span>) {
        <span style="color: #424242; font-weight: bold;">visitBottomUp</span>(all, escAnalyze)
}
<span style="color: #989848;">func</span> <span style="color: #424242; font-weight: bold;">escAnalyze</span>(all []*<span style="color: #0287c8; font-weight: bold;">Node</span>, recursive <span style="color: #0287c8; font-weight: bold;">bool</span>) {
        <span style="color: #40883f;">//</span><span style="color: #40883f;">...</span>
}
<span style="color: #989848;">func</span> <span style="color: #424242; font-weight: bold;">visitBottomUp</span>(list []*<span style="color: #0287c8; font-weight: bold;">Node</span>, analyze <span style="color: #989848;">func</span>(list []*<span style="color: #0287c8; font-weight: bold;">Node</span>, recursive <span style="color: #0287c8; font-weight: bold;">bool</span>)) {
        <span style="color: #40883f;">// </span><span style="color: #40883f;">...</span>
        <span style="color: #989848;">for</span> _, n := <span style="color: #989848;">range</span> list {
                <span style="color: #989848;">if</span> n.Op == ODCLFUNC &amp;&amp; !n.Func.<span style="color: #424242; font-weight: bold;">IsHiddenClosure</span>() {
                        v.<span style="color: #424242; font-weight: bold;">visit</span>(n)
                }
        }
}
</pre>
</div>
<p>
On the whole, <code>[]*Node</code> can be seen as a list of trees, also as a graph, because
some subtrees are connected to each other.
</p>

<p>
As you can see from the name of <code>visitBottomUp</code>, it will traverse from bottom to
top, and its argument <code>analyze</code>'s first argument <code>list</code> is <code>[]*Node</code>, its
content is a list of functions, each function will only call other functions in
the list or functions that have been passed in previous invocations of <code>analyze</code>
</p>

<p>
Said in the previous paragraph, the function in <code>list</code> will only call the
functions in <code>list</code>.
This includes 2 cases:
</p>
<ul class="org-ul">
<li>Several functions that are called recursively to each other</li>
<li>Single function</li>
</ul>
</div>
</div>



<div id="outline-container-org39f905a" class="outline-2">
<h2 id="org39f905a"><span class="section-number-2">4</span> draft notes</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>What does 'loopdepth' do?</li>

<li>what is sink node?</li>

<li>what's level.copy for?</li>
</ul>
</div>
</div>

<div id="outline-container-orgf2766fc" class="outline-2">
<h2 id="orgf2766fc"><span class="section-number-2">5</span> references</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="https://web.archive.org/web/20170930011137/http://blog.rocana.com/golang-escape-analysis">https://web.archive.org/web/20170930011137/http://blog.rocana.com/golang-escape-analysis</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
